
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 11 to change, 8 to destroy.</code></pre>

* Create
  * module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;8930ea9f-6dec-4bc4-a987-140e5d40df39&#34;]
* Update
  * azurerm_automation_account.automation_account
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_schedule.trigger_once
  * module.keyvault_secrets.azurerm_key_vault_secret.secret[&#34;mi-id&#34;]
  * module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds
  * module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;4800c310-cd45-4e90-9cf9-857bd0e33759&#34;]
* Replace
  * azurerm_key_vault_access_policy.policy
  * azurerm_role_assignment.mi_sa[&#34;Contributor&#34;]
  * azurerm_role_assignment.mi_sa[&#34;Storage Blob Data Contributor&#34;]
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rl&#34;].azurerm_automation_job_schedule.trigger_once
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.schedule
  * module.automation_runbook_sas_token_renewal[&#34;rota-rlw&#34;].azurerm_automation_job_schedule.trigger_once


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_automation_account.automation_account will be updated in-place
  ~ resource "azurerm_automation_account" "automation_account" {
        id                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa"
        name                          = "hmi-stg-aa"
        tags                          = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
        # (10 unchanged attributes hidden)

      ~ identity {
          ~ identity_ids = [
              + "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/hmi-sds-stg-mi",
              - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/managed-identities-stg-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/hmi-stg-mi",
                # (1 unchanged element hidden)
            ]
            # (3 unchanged attributes hidden)
        }
    }

  # azurerm_key_vault_access_policy.policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-rota/objectId/4800c310-cd45-4e90-9cf9-857bd0e33759" -> (known after apply)
      - key_permissions         = [] -> null
      ~ object_id               = "4800c310-cd45-4e90-9cf9-857bd0e33759" -> "8930ea9f-6dec-4bc4-a987-140e5d40df39" # forces replacement
      - storage_permissions     = [] -> null
        # (4 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mi_sa["Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "mi_sa" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg/providers/Microsoft.Authorization/roleAssignments/71054340-4b15-755d-9686-f9e1cdf9ad94" -> (known after apply)
      ~ name                             = "71054340-4b15-755d-9686-f9e1cdf9ad94" -> (known after apply)
      ~ principal_id                     = "4800c310-cd45-4e90-9cf9-857bd0e33759" -> "8930ea9f-6dec-4bc4-a987-140e5d40df39" # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/b24988ac-6180-42a0-ab88-20f7382dd24c" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # azurerm_role_assignment.mi_sa["Storage Blob Data Contributor"] must be replaced
-/+ resource "azurerm_role_assignment" "mi_sa" {
      ~ id                               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Storage/storageAccounts/hmisastg/providers/Microsoft.Authorization/roleAssignments/fc179534-f7b1-cae1-aa7d-9bf6aafd7246" -> (known after apply)
      ~ name                             = "fc179534-f7b1-cae1-aa7d-9bf6aafd7246" -> (known after apply)
      ~ principal_id                     = "4800c310-cd45-4e90-9cf9-857bd0e33759" -> "8930ea9f-6dec-4bc4-a987-140e5d40df39" # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/providers/Microsoft.Authorization/roleDefinitions/ba92f5b4-2d11-453d-a403-e96b0029c9fe" -> (known after apply)
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.schedule must be replaced
-/+ resource "azurerm_automation_job_schedule" "schedule" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/c0769c48-6cb2-4245-b5b4-3c98d734a6e4" -> (known after apply)
      ~ job_schedule_id         = "c0769c48-6cb2-4245-b5b4-3c98d734a6e4" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759" -> "8930ea9f-6dec-4bc4-a987-140e5d40df39"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_job_schedule.trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/0b9db096-17ce-4c5b-849e-7a6f1aa2d89d" -> (known after apply)
      ~ job_schedule_id         = "0b9db096-17ce-4c5b-849e-7a6f1aa2d89d" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759" -> "8930ea9f-6dec-4bc4-a987-140e5d40df39"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule"
      ~ start_time              = "2023-11-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rl"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rl-schedule-single-trigger"
      ~ start_time              = "2023-11-29T14:39:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.schedule must be replaced
-/+ resource "azurerm_automation_job_schedule" "schedule" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/8ff5fc36-f6e5-4d01-afcb-7f998d1267dc" -> (known after apply)
      ~ job_schedule_id         = "8ff5fc36-f6e5-4d01-afcb-7f998d1267dc" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759" -> "8930ea9f-6dec-4bc4-a987-140e5d40df39"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_job_schedule.trigger_once must be replaced
-/+ resource "azurerm_automation_job_schedule" "trigger_once" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/jobSchedules/b4b3625b-73b4-4ef9-8e9c-1e5cfe6d75a4" -> (known after apply)
      ~ job_schedule_id         = "b4b3625b-73b4-4ef9-8e9c-1e5cfe6d75a4" -> (known after apply)
      ~ parameters              = { # forces replacement
          ~ "umi_client_id"        = "4800c310-cd45-4e90-9cf9-857bd0e33759" -> "8930ea9f-6dec-4bc4-a987-140e5d40df39"
            # (11 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.schedule will be updated in-place
  ~ resource "azurerm_automation_schedule" "schedule" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule"
      ~ start_time              = "2023-11-30T01:00:00Z" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.automation_runbook_sas_token_renewal["rota-rlw"].azurerm_automation_schedule.trigger_once will be updated in-place
  ~ resource "azurerm_automation_schedule" "trigger_once" {
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.Automation/automationAccounts/hmi-stg-aa/schedules/rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
        name                    = "rotate-sas-tokens-hmisastg-rota-rlw-schedule-single-trigger"
      ~ start_time              = "2023-11-29T14:39:00Z" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.keyvault_secrets.azurerm_key_vault_secret.secret["mi-id"] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "secret" {
        id                      = "https://hmi-sds-kv-stg.vault.azure.net/secrets/mi-id/08aaf1a89aa745cdaa232709fa74db2d"
        name                    = "mi-id"
        tags                    = {
            "application"         = "hearings-management-interface"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/hmi-shared-infrastructures.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#hearing-management-information"
            "environment"         = "staging"
            "managedBy"           = "Future Hearings - Hearing Management Information"
        }
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # module.kv_cft.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-cft|hmi-sds-kv-stg-cft"
        name                           = "hmi-sds-kv-stg-cft"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_crime.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-crime|hmi-sds-kv-stg-crime"
        name                           = "hmi-sds-kv-stg-crime"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy["4800c310-cd45-4e90-9cf9-857bd0e33759"] will be destroyed
  # (because key ["4800c310-cd45-4e90-9cf9-857bd0e33759"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      - certificate_permissions = [
          - "Get",
          - "List",
        ] -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg/objectId/4800c310-cd45-4e90-9cf9-857bd0e33759" -> null
      - key_permissions         = [
          - "Get",
          - "List",
        ] -> null
      - key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg" -> null
      - object_id               = "4800c310-cd45-4e90-9cf9-857bd0e33759" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.kv_hmi.azurerm_key_vault_access_policy.managed_identity_access_policy["8930ea9f-6dec-4bc4-a987-140e5d40df39"] will be created
  + resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      + certificate_permissions = [
          + "Get",
          + "List",
        ]
      + id                      = (known after apply)
      + key_permissions         = [
          + "Get",
          + "List",
        ]
      + key_vault_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg"
      + object_id               = "8930ea9f-6dec-4bc4-a987-140e5d40df39"
      + secret_permissions      = [
          + "Get",
          + "List",
        ]
      + tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.kv_hmi.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg|hmi-sds-kv-stg"
        name                           = "hmi-sds-kv-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_rota.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-rota|hmi-sds-kv-stg-rota"
        name                           = "hmi-sds-kv-stg-rota"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.kv_snl.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/hmi-sharedinfra-sds-stg-rg/providers/Microsoft.KeyVault/vaults/hmi-sds-kv-stg-snl|hmi-sds-kv-stg-snl"
        name                           = "hmi-sds-kv-stg-snl"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

Plan: 8 to add, 11 to change, 8 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":51,"Program":"tfcmt","SHA1":"","Vars":{}} -->